.config/emacs/config.org
#+TITLE:Abhishek's GNU Emacs Config
#+AUTHOR: Abhishek Mishra
#+DESCRIPTION: Abhishek's personal Emacs config
#+SRARTUP: showeverything
#+OPTION: toc:2

* TABLE OF CONTENTS :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#package-manager][Package Manager]]
- [[#reload-emacs][RELOAD EMACS]]
- [[#ivy][IVY]]
- [[#helpfull][HELPFULL]]
- [[#which-key][WHICH-KEY]]
- [[#dired][DIRED]]
- [[#neotree][NEOTREE]]
- [[#app-launchers][APP LAUNCHERS]]
  - [[#counsel-linux-app][Counsel-Linux-App]]
- [[#looks][Looks]]
  - [[#transparency][TRANSPARENCY]]
  - [[#dashboard][DASHBOARD]]
  - [[#menubar-and-themes][Menubar and themes]]
  - [[#color-themes][Color Themes]]
  - [[#display-line-numbers-and-truncated-lines][Display Line Numbers and Truncated Lines]]
  - [[#org-mode][ORG MODE]]
  - [[#fonts][FONTS]]
  - [[#all-the-icons][All the icons]]
  - [[#zooming-inout][Zooming In/Out]]
  - [[#doom-modeline][Doom ModeLine]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
- [[#keybindings][KEYBINDINGS]]
  - [[#counsel][COUNSEL]]
  - [[#general][General]]
  - [[#sudo-edit][SUDO EDIT]]
  - [[#evil][EVIL]]
  - [[#hydra][HydrA]]
- [[#development][Development]]
  - [[#backup][BACKUP]]
  - [[#projectile][PROJECTILE]]
  - [[#languages-and-ide-features-with-lsp-mode][Languages and IDE Features with LSP-mode]]
  - [[#company-mode][Company Mode]]
  - [[#flycheck][FLYCHECK]]
  - [[#commenting][Commenting]]

* IMPORTANT PROGRAMS TO LOAD FIRST

** Package Manager
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
  (package-refresh-contents))

  (unless (package-installed-p 'use-package)
     (package-install 'use-package))
  
  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

* RELOAD EMACS
This is just an example of how to create a simple function in Emacs.  Use this function to reload Emacs after adding changes to the config.  Yes, I am loading the user-init-file twice in this function, which is a hack because for some reason, just loading the user-init-file once does not work properly.

#+begin_src emacs-lisp
(defun reload-init-file ()
  (interactive)
  (load-file user-init-file)
  (load-file user-init-file))
#+end_src


* IVY
#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
#+end_src

*** IVY Rich
#+begin_src emacs-lisp
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src

*** Improved Candidate Sorting with prescient.el

prescient.el provides some helpful behavior for sorting Ivy completion candidates based on how recently or frequently you select them.  This can be especially helpful when using =M-x= to run commands that you don't have bound to a key but still need to access occasionally.

This Prescient configuration is optimized for use in System Crafters videos and streams, check out the [[https://youtu.be/T9kygXveEz0][video on prescient.el]] for more details on how to configure it!

#+begin_src emacs-lisp

  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions!
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))

#+end_src

*** Ivy icon pack 
#+begin_src emacs-lisp
  (use-package all-the-icons-ivy-rich
    :ensure t
    :init (all-the-icons-ivy-rich-mode 1))
#+end_src

* HELPFULL
#+begin_src emacs-lisp
  (use-package helpful
   :custom
   (counsel-describe-function-function #'helpfull-callable)
   (counsel-describe-variable-function #'helpfull-variable)
   ;; :bind
   ;; ([remap describe-function] . counsel-describe-function)
   ;; ([remap describe-command] . helpfull-command)
   ;; ([remap describe-variable] . counsel-describe-variable)
   ;; ([remap describe-key] . helpfull.key)
   )
#+end_src

* WHICH-KEY
#+begin_src emacs-lisp
  (use-package which-key
     :init
     (which-key-mode 1)
     :config
     (setq which-key-side-window-location 'bottom
	   which-key-sort-order #'which-key-key-order-alpha
	   which-key-sort-uppercase-first nil
	   which-key-add-column-padding 1
	   which-key-max-display-columns nil
	   which-key-min-display-lines 6
	   which-key-side-window-slot -10
	   which-key-side-window-max-height 0.25
	   which-key-idle-delay 0.3
	   which-key-max-description-length 25
	   which-key-allow-imprecise-window-fit nil
	   which-key-separator " → " ))
#+end_src

* DIRED
#+begin_src emacs-lisp
  (use-package dired-open
    :config
    (setq dired-open-extensions '(("gif" . "sxiv")
                                  ("jpg" . "sxiv")
                                  ("png" . "sxiv")
                                  ("mkv" . "mpv")
                                  ("mp4" . "mpv"))))

  (use-package peep-dired
    :after dired
    :hook (evil-normalize-keymaps . peep-dired-hook)
    :config
      (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
      (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
      (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
      (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)
  )

  ;;(add-hook 'peep-dired-hook 'evil-normalize-keymaps)

#+end_src

* NEOTREE
Neotree is a file tree viewer.  When you open neotree, it jumps to the current file thanks to neo-smart-open.  The neo-window-fixed-size setting makes the neotree width be adjustable.  NeoTree provides following themes: classic, ascii, arrow, icons, and nerd.  Theme can be configed by setting "two" themes for neo-theme: one for the GUI and one for the terminal.  I like to use 'SPC t' for 'toggle' keybindings, so I have used 'SPC t n' for toggle-neotree.

| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | /Toggle neotree/            | SPC t n    |
| neotree- dir   | /Open directory in neotree/ | SPC d n    |

#+BEGIN_SRC emacs-lisp
(use-package neotree
  :config
  (setq neo-smart-open t
        neo-show-hidden-files t
        neo-window-width 45
        neo-window-fixed-size nil
        inhibit-compacting-font-caches t
        projectile-switch-project-action 'neotree-projectile-action) 
        ;; truncate long file names in neotree
        (add-hook 'neo-after-create-hook
           #'(lambda (_)
               (with-current-buffer (get-buffer neo-buffer-name)
                 (setq truncate-lines t)
                 (setq word-wrap nil)
                 (make-local-variable 'auto-hscroll-mode)
                 (setq auto-hscroll-mode nil)))))

;; show hidden files
#+end_src


* APP LAUNCHERS

** Counsel-Linux-App
Since we have counsel installed, we can use =counsel-linux-app= to launch our Linux apps.  It list the apps by their executable command, so it's kind of tricky to use.

#+begin_src emacs-lisp
;; (defun emacs-counsel-launcher ()
;;   "Create and select a frame called emacs-counsel-launcher which consists only of a minibuffer and has specific dimensions. Runs counsel-linux-app on that frame, which is an emacs command that prompts you to select an app and open it in a dmenu like behaviour. Delete the frame after that command has exited"
;;   (interactive)
;;   (with-selected-frame 
;;     (make-frame '((name . "emacs-run-launcher")
;;                   (minibuffer . only)
;;                   (fullscreen . 0) ; no fullscreen
;;                   (undecorated . t) ; remove title bar
;;                   ;;(auto-raise . t) ; focus on this frame
;;                   ;;(tool-bar-lines . 0)
;;                   ;;(menu-bar-lines . 0)
;;                   (internal-border-width . 10)
;;                   (width . 80)
;;                   (height . 11)))
;;                   (unwind-protect
;;                     (counsel-linux-app)
;;                     (delete-frame))))

#+end_src


* Looks

** TRANSPARENCY
With Emacs version 29, true transparency has been added.  

#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(alpha-background . 90)) ; For all new frames henceforth

#+end_src


** DASHBOARD
Emacs Dashboard is an extensible startup screen showing you recent files, bookmarks, agenda items and an Emacs banner.

#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t 
    :init
    (setq initial-buffer-choice 'dashboard-open)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
    ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
    (setq dashboard-startup-banner "/home/abhi/.config/emacs/Images/emacs-dash3.png")  ;; use custom image as banner
    (setq dashboard-center-content nil) ;; set to 't' for centered content
    (setq dashboard-items '((recents . 5)
                            (agenda . 5 )
                            (bookmarks . 3)
                            (projects . 3)
                            (registers . 3)))
    :custom
    (dashboard-modify-heading-icons '((recents . "file-text")
                                      (bookmarks . "book")))
    :config
    (dashboard-setup-startup-hook))
#+end_src


** Menubar and themes
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  (scroll-bar-mode -1)             ; Disable visible scrollbar
  (tool-bar-mode -1)               ; Disable the toolbar
  (tooltip-mode -1)                ; Disable tooltips
  (set-fringe-mode 10)             ; Give some breathing room
  (menu-bar-mode -1)             ; Disable the menu bar
  ; Set up the visible bell
  (setq visible-bell t)
  ; Make ESC quit prompts

  ; (load-theme 'wombat)
#+end_src

** Color Themes
#+begin_src emacs-lisp
(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
	    doom-themes-enabel-italic t)

  (load-theme 'doom-dark+ t)

  (doom-themes-neotree-config)

  (doom-themes-org-config))  
#+end_src

** Display Line Numbers and Truncated Lines
#+begin_src emacs-lisp
  (column-number-mode)
  (global-display-line-numbers-mode)
  (global-visual-line-mode )  
#+end_src

*** Disable line numbers for some modes
#+begin_src emacs-lisp
  (dolist (mode '(
	;; org-mode-hook
		  term-mode-hook
		  shell-mode-hook
		  eshell-mode-hook
		  treemacs-mode-hook))
	      (add-hook mode(lambda ()(display-line-numbers-mode 0))))
#+end_src

** ORG MODE
*** Enabling Table of Contents
#+begin_src emacs-lisp
  (use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** Enabling Org Bullets
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

*** ORG LEVELS
#+begin_src emacs-lisp
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "JetBrainsMono Nerd Font" :weight 'regular :height (cdr face)))
#+end_src

*** Replace list hyphen with dot
#+begin_src emacs-lisp

  ;; (defun efs/org-mode-visual-fill ()
  ;;  (setq visual-fill-column-width 200
  ;;        visual-fill-column-center-text t)
  ;;  (visual-fill-column-mode 1))

  ;; (use-package visual-fill-column
  ;;  :hook (org-mode . efs/org-mode-visual-fill))

#+end_src

*** Org Babel
#+begin_src emacs-lisp
   (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)
  (setq org-confirm-babel-evaluate nil)
#+end_src

*** Structure Templates
#+begin_src emacs-lisp
  ;; This isi needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
#+end_src

